{
  "dataset": {
    "id": "lcquad-train-original"
  },
  "questions": [
    {
      "id": "lcquad_train_128",
      "question": [
        {
          "language": "en",
          "string": "Did Steve Sampson manage a club of Santa Clara university"
        }
      ],
      "query": {
        "sparql": "ASK WHERE { <http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University> }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/managerClub",
        "none"
      ]
    },
    {
      "id": "lcquad_train_1472",
      "question": [
        {
          "language": "en",
          "string": "Count the different causes of death of Christians."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/religion",
        "http://dbpedia.org/ontology/deathCause",
        "count"
      ]
    },
    {
      "id": "lcquad_train_4198",
      "question": [
        {
          "language": "en",
          "string": "List the alma mater of the person who is wedded to Sissela Bok."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Sissela_Bok> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/spouse",
        "http://dbpedia.org/property/almaMater",
        "none"
      ]
    },
    {
      "id": "lcquad_train_3427",
      "question": [
        {
          "language": "en",
          "string": "Mazhar Ul Haq High School, Beerwah is affiliated to Islamic Religion"
        }
      ],
      "query": {
        "sparql": "ASK WHERE { <http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah> <http://dbpedia.org/property/religiousAffiliation> <http://dbpedia.org/resource/Islam> }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/religiousAffiliation",
        "none"
      ]
    },
    {
      "id": "lcquad_train_1273",
      "question": [
        {
          "language": "en",
          "string": "List all the tenants of the stadium where the WWF Summer Slam 2004 took place."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/venue",
        "http://dbpedia.org/ontology/tenant",
        "none"
      ]
    },
    {
      "id": "lcquad_train_906",
      "question": [
        {
          "language": "en",
          "string": "Who is married to Tony Ramo"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/partner> <http://dbpedia.org/resource/Tony_Romo>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/partner",
        "none"
      ]
    },
    {
      "id": "lcquad_train_1245",
      "question": [
        {
          "language": "en",
          "string": "Name some people working at someplace owned by News Corp."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/News_Corp> . ?uri <http://dbpedia.org/ontology/employer> ?x  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/owners",
        "http://dbpedia.org/ontology/employer",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4712",
      "question": [
        {
          "language": "en",
          "string": "Count the tenants of the stadiums owned by toronto."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Toronto> . ?x <http://dbpedia.org/property/tenants> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/owner",
        "http://dbpedia.org/property/tenants",
        "count"
      ]
    },
    {
      "id": "lcquad_train_1137",
      "question": [
        {
          "language": "en",
          "string": "Count the number of religions followed by Janta Dal members."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Janata_Dal> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/party",
        "http://dbpedia.org/ontology/religion",
        "count"
      ]
    },
    {
      "id": "lcquad_train_1913",
      "question": [
        {
          "language": "en",
          "string": "Who did Bruce Bochy play for ? "
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bruce_Bochy> <http://dbpedia.org/ontology/team> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/team",
        "none"
      ]
    },
    {
      "id": "lcquad_train_1262",
      "question": [
        {
          "language": "en",
          "string": "what are some journals of academic Philosophy"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/discipline> <http://dbpedia.org/resource/Philosophy> } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/discipline",
        "none"
      ]
    },
    {
      "id": "lcquad_train_2941",
      "question": [
        {
          "language": "en",
          "string": "What is the common award won by Charles LeMaire and Eric Roth"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charles_LeMaire> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/Eric_Roth> <http://dbpedia.org/ontology/award> ?uri} "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/awards",
        "http://dbpedia.org/ontology/award",
        "none"
      ]
    },
    {
      "id": "lcquad_train_3029",
      "question": [
        {
          "language": "en",
          "string": "For which team did both Butch Metzger and Brian Horwitz debuted ? "
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?uri. <http://dbpedia.org/resource/Brian_Horwitz> <http://dbpedia.org/ontology/debutTeam> ?uri . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/debutTeam",
        "http://dbpedia.org/ontology/debutTeam",
        "none"
      ]
    },
    {
      "id": "lcquad_train_401",
      "question": [
        {
          "language": "en",
          "string": "Who coached the marquet golden eagels during 2013"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2013\u201314_Marquette_Golden_Eagles_men's_basketball_team> <http://dbpedia.org/ontology/coach> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/coach",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4196",
      "question": [
        {
          "language": "en",
          "string": "What are some products manufactured by Sony? "
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/manufacturer",
        "none"
      ]
    },
    {
      "id": "lcquad_train_129",
      "question": [
        {
          "language": "en",
          "string": "What newspapers's owners is Schibsted"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/Schibsted>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/owners",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "none"
      ]
    },
    {
      "id": "lcquad_train_2599",
      "question": [
        {
          "language": "en",
          "string": "What fictional character's species is American Pekin duck"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/American_Pekin_duck> } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/species",
        "none"
      ]
    },
    {
      "id": "lcquad_train_933",
      "question": [
        {
          "language": "en",
          "string": "Count all the games whose distributors are located in America"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/distributor> ?x  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/country",
        "http://dbpedia.org/property/distributor",
        "count"
      ]
    },
    {
      "id": "lcquad_train_706",
      "question": [
        {
          "language": "en",
          "string": "Who is the spouse of Daniel Gibson? "
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Daniel_Gibson>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/spouse",
        "none"
      ]
    },
    {
      "id": "lcquad_train_909",
      "question": [
        {
          "language": "en",
          "string": "Who wrote Heroman?"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heroman> <http://dbpedia.org/property/author> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/author",
        "none"
      ]
    }
  ]
}