{
  "dataset": {
    "id": "lcquad-train-original"
  },
  "questions": [
    {
      "id": "lcquad_train_2633",
      "question": [
        {
          "language": "en",
          "string": "Count all those whose youth club was managed by Luis Enrique."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/Luis_Enrique_(footballer)> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/manager",
        "http://dbpedia.org/property/youthclubs",
        "count"
      ]
    },
    {
      "id": "lcquad_train_1052",
      "question": [
        {
          "language": "en",
          "string": "Is Microsoft office written in C++"
        }
      ],
      "query": {
        "sparql": "ASK WHERE { <http://dbpedia.org/resource/Microsoft_Office> <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C++> }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/programmingLanguage",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4838",
      "question": [
        {
          "language": "en",
          "string": "Which company's division is Audi India? Correct Question"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/Audi_India> } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/divisions",
        "none"
      ]
    },
    {
      "id": "lcquad_train_877",
      "question": [
        {
          "language": "en",
          "string": "Count all the things licensed as Software as a service."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/Software_as_a_service>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/license",
        "count"
      ]
    },
    {
      "id": "lcquad_train_2223",
      "question": [
        {
          "language": "en",
          "string": "Count the drinks originated in England."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/England>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>}"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/origin",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "count"
      ]
    },
    {
      "id": "lcquad_train_1739",
      "question": [
        {
          "language": "en",
          "string": "Give me some softwares which run on mac os"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/operatingSystem",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "none"
      ]
    },
    {
      "id": "lcquad_train_893",
      "question": [
        {
          "language": "en",
          "string": "Does Walt Disney Studio have a subsidiary called PixarCascadia_"
        }
      ],
      "query": {
        "sparql": "ASK WHERE { <http://dbpedia.org/resource/Walt_Disney_Studios_(division)> <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Pixar> }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/subsidiary",
        "none"
      ]
    },
    {
      "id": "lcquad_train_3654",
      "question": [
        {
          "language": "en",
          "string": "List the religions of the commanders of Royal Thai Army."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Royal_Thai_Army> <http://dbpedia.org/property/notableCommanders> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/notableCommanders",
        "http://dbpedia.org/ontology/religion",
        "none"
      ]
    },
    {
      "id": "lcquad_train_2450",
      "question": [
        {
          "language": "en",
          "string": "Give me a count of everything made by the company which offers electronical manufacturing too."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/service",
        "http://dbpedia.org/ontology/manufacturer",
        "count"
      ]
    },
    {
      "id": "lcquad_train_2146",
      "question": [
        {
          "language": "en",
          "string": "Name everyone working for a company owned by Roman Abramovich."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> . ?uri <http://dbpedia.org/ontology/occupation> ?x  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/owningCompany",
        "http://dbpedia.org/ontology/occupation",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4415",
      "question": [
        {
          "language": "en",
          "string": "How many bacterias have taxonomy as Bacillales and domain as Bacteria? "
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Bacillales> . ?uri <http://dbpedia.org/property/domain> <http://dbpedia.org/resource/Bacteria> } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/order",
        "http://dbpedia.org/property/domain",
        "count"
      ]
    },
    {
      "id": "lcquad_train_3668",
      "question": [
        {
          "language": "en",
          "string": "List few authors whose education took place in Saint Petersburg ?   "
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/education> <http://dbpedia.org/resource/Saint_Petersburg>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/education",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "none"
      ]
    },
    {
      "id": "lcquad_train_577",
      "question": [
        {
          "language": "en",
          "string": "Whose doctoral student is etienne bieler\\xc9tienne_Bi\\xe9ler"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler> } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/doctoralStudent",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4525",
      "question": [
        {
          "language": "en",
          "string": "Name the ones who debuted in the San Francisco 49ers."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/debutTeam> <http://dbpedia.org/resource/San_Francisco_49ers>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/debutTeam",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4741",
      "question": [
        {
          "language": "en",
          "string": "Name the part of Liverpool city region >"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liverpool_City_Region> <http://dbpedia.org/ontology/part> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/part",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4299",
      "question": [
        {
          "language": "en",
          "string": "Count the different religions followed by Second Lieutenants in military."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Second_lieutenant> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/militaryRank",
        "http://dbpedia.org/ontology/religion",
        "count"
      ]
    },
    {
      "id": "lcquad_train_3676",
      "question": [
        {
          "language": "en",
          "string": "Is Eddie Bravo the trainer of Alan Jouban"
        }
      ],
      "query": {
        "sparql": "ASK WHERE { <http://dbpedia.org/resource/Alan_Jouban> <http://dbpedia.org/ontology/trainer> <http://dbpedia.org/resource/Eddie_Bravo> }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/trainer",
        "none"
      ]
    },
    {
      "id": "lcquad_train_3526",
      "question": [
        {
          "language": "en",
          "string": "name the home stadium of FC Spartak Moscow season 2011-12"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/homeStadium",
        "none"
      ]
    },
    {
      "id": "lcquad_train_2710",
      "question": [
        {
          "language": "en",
          "string": "Count the different religions practiced by people who are in the Malaysian and Chinese association."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Malaysian_Chinese_Association> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/party",
        "http://dbpedia.org/ontology/religion",
        "count"
      ]
    },
    {
      "id": "lcquad_train_2654",
      "question": [
        {
          "language": "en",
          "string": "List all those whose relatives' nationality is United States."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/ontology/relative> ?x  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/nationality",
        "http://dbpedia.org/ontology/relative",
        "none"
      ]
    },
    {
      "id": "lcquad_train_2418",
      "question": [
        {
          "language": "en",
          "string": "Count the  origin of the beverages which have been originated in england /"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/origin> ?uri }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/origin",
        "http://dbpedia.org/property/origin",
        "count"
      ]
    },
    {
      "id": "lcquad_train_4561",
      "question": [
        {
          "language": "en",
          "string": "Count the religions followed by people living in British Columbia."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/British_Columbia> . ?x <http://dbpedia.org/property/religion> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/residence",
        "http://dbpedia.org/property/religion",
        "count"
      ]
    },
    {
      "id": "lcquad_train_4038",
      "question": [
        {
          "language": "en",
          "string": "For everyone who died in paris, count their different fields of work."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris> . ?x <http://dbpedia.org/property/fields> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/deathPlace",
        "http://dbpedia.org/property/fields",
        "count"
      ]
    },
    {
      "id": "lcquad_train_239",
      "question": [
        {
          "language": "en",
          "string": "Count the number of actors in Lucy Sullivan Is Getting Married."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married> <http://dbpedia.org/property/starring> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/starring",
        "count"
      ]
    },
    {
      "id": "lcquad_train_4676",
      "question": [
        {
          "language": "en",
          "string": "Estimate the number of sports divisions at the universities under international association of universities."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/International_Association_of_Universities> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/affiliation",
        "http://dbpedia.org/ontology/sport",
        "count"
      ]
    },
    {
      "id": "lcquad_train_2512",
      "question": [
        {
          "language": "en",
          "string": "Name a few whose live in a place where Indian English is an official language"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/officialLanguage",
        "http://dbpedia.org/ontology/residence",
        "none"
      ]
    },
    {
      "id": "lcquad_train_309",
      "question": [
        {
          "language": "en",
          "string": "Give me a count of everything under the archipelago, where Papeete is the biggest town."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> . ?uri <http://dbpedia.org/property/archipelago> ?x  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/largestCity",
        "http://dbpedia.org/property/archipelago",
        "count"
      ]
    },
    {
      "id": "lcquad_train_3159",
      "question": [
        {
          "language": "en",
          "string": "Who all have been canonized by Pope Paul VI"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Pope_Paul_VI> } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/canonizedBy",
        "none"
      ]
    },
    {
      "id": "lcquad_train_73",
      "question": [
        {
          "language": "en",
          "string": "List the base currency of the country whose anthem is Oj, svijetla majska zoro."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x <http://dbpedia.org/property/currency> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/anthem",
        "http://dbpedia.org/property/currency",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4230",
      "question": [
        {
          "language": "en",
          "string": "List the children of the parent of Marvin Bush."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marvin_Bush> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/property/children> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/parent",
        "http://dbpedia.org/property/children",
        "none"
      ]
    },
    {
      "id": "lcquad_train_620",
      "question": [
        {
          "language": "en",
          "string": "How many "
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/team",
        "count"
      ]
    },
    {
      "id": "lcquad_train_4197",
      "question": [
        {
          "language": "en",
          "string": "What is the almamater of the successor of F. A. Little, Jr.? "
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/F._A._Little,_Jr.> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/successor",
        "http://dbpedia.org/ontology/almaMater",
        "none"
      ]
    },
    {
      "id": "lcquad_train_30",
      "question": [
        {
          "language": "en",
          "string": "Name the mascot of the military branch of William Harper."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)> <http://dbpedia.org/ontology/militaryBranch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/militaryBranch",
        "http://dbpedia.org/property/mascot",
        "none"
      ]
    },
    {
      "id": "lcquad_train_1022",
      "question": [
        {
          "language": "en",
          "string": "What is the nationality of the J. T. Krogh which is also the  sovereign state of the Camilla Martin"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/J._T._Krogh> <http://dbpedia.org/ontology/nationality> ?uri. <http://dbpedia.org/resource/Camilla_Martin> <http://dbpedia.org/ontology/country> ?uri} "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/country",
        "http://dbpedia.org/ontology/nationality",
        "count"
      ]
    },
    {
      "id": "lcquad_train_1207",
      "question": [
        {
          "language": "en",
          "string": "Is lion an animal?"
        }
      ],
      "query": {
        "sparql": "ASK WHERE { <http://dbpedia.org/resource/Lion> <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/kingdom",
        "none"
      ]
    },
    {
      "id": "lcquad_train_245",
      "question": [
        {
          "language": "en",
          "string": "Count all the scientologists."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Scientology>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/religion",
        "count"
      ]
    },
    {
      "id": "lcquad_train_58",
      "question": [
        {
          "language": "en",
          "string": "Which tenants of the Master Card center is also th draft team of Sam Carrrick "
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?uri. <http://dbpedia.org/resource/Sam_Carrick> <http://dbpedia.org/property/draftTeam> ?uri} "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/tenants",
        "http://dbpedia.org/property/draftTeam",
        "none"
      ]
    },
    {
      "id": "lcquad_train_2314",
      "question": [
        {
          "language": "en",
          "string": "What is a salthill?"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/type",
        "none"
      ]
    },
    {
      "id": "lcquad_train_3467",
      "question": [
        {
          "language": "en",
          "string": "Which state is the birth location of Ann Monroe Gilchrist Strong? "
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/birthPlace",
        "http://dbpedia.org/ontology/country",
        "count"
      ]
    },
    {
      "id": "lcquad_train_1774",
      "question": [
        {
          "language": "en",
          "string": "Count the total religions followed by the ones living in England."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/religion> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/residence",
        "http://dbpedia.org/property/religion",
        "count"
      ]
    },
    {
      "id": "lcquad_train_4774",
      "question": [
        {
          "language": "en",
          "string": "Is Serbian Titieca a doctoral student of Werner Heisenberghttp://dbpedia.org/resource/Werner_Heisenberg"
        }
      ],
      "query": {
        "sparql": "ASK WHERE { <http://dbpedia.org/resource/Werner_Heisenberg> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica> }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/doctoralStudent",
        "none"
      ]
    },
    {
      "id": "lcquad_train_2321",
      "question": [
        {
          "language": "en",
          "string": "Does the white river flow into the connecticut river{u'_id': u'97e02dcf44aa43c1b7cc7a7c155b118f',"
        }
      ],
      "query": {
        "sparql": "ASK WHERE { <http://dbpedia.org/resource/Connecticut_River> <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/White_River_(Vermont)> }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/rightTributary",
        "none"
      ]
    },
    {
      "id": "lcquad_train_2629",
      "question": [
        {
          "language": "en",
          "string": "Where did ed podolak go to high school"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ed_Podolak> <http://dbpedia.org/ontology/highschool> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/highschool",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4073",
      "question": [
        {
          "language": "en",
          "string": "Give me the number of home stadiums of teams managed by John Spencer."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/manager",
        "http://dbpedia.org/ontology/homeStadium",
        "count"
      ]
    },
    {
      "id": "lcquad_train_500",
      "question": [
        {
          "language": "en",
          "string": "What writers have nationality as Statelessness?  "
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/Statelessness>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/nationality",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4048",
      "question": [
        {
          "language": "en",
          "string": "List the sports played in private universities."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Private_university> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/type",
        "http://dbpedia.org/ontology/sport",
        "none"
      ]
    },
    {
      "id": "lcquad_train_2159",
      "question": [
        {
          "language": "en",
          "string": "List the awards won by the wife of Ingrid von Rosen."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingrid_von_Rosen> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/spouse",
        "http://dbpedia.org/property/awards",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4350",
      "question": [
        {
          "language": "en",
          "string": "Count the different genres of games published by Titus Software"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Titus_Software> . ?x <http://dbpedia.org/ontology/genre> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/publisher",
        "http://dbpedia.org/ontology/genre",
        "count"
      ]
    },
    {
      "id": "lcquad_train_1688",
      "question": [
        {
          "language": "en",
          "string": "Count all the places where companies located in Ontario operate."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/locationCity",
        "http://dbpedia.org/property/locations",
        "count"
      ]
    },
    {
      "id": "lcquad_train_3320",
      "question": [
        {
          "language": "en",
          "string": "Count the awards won by the people who graduated from the National and Kapodistrian University of Athens."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens> . ?x <http://dbpedia.org/ontology/award> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/almaMater",
        "http://dbpedia.org/ontology/award",
        "count"
      ]
    },
    {
      "id": "lcquad_train_1234",
      "question": [
        {
          "language": "en",
          "string": "?What are the airline hubs of Cascade Airways"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cascade_Airways> <http://dbpedia.org/property/hubs> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/hubs",
        "none"
      ]
    },
    {
      "id": "lcquad_train_1587",
      "question": [
        {
          "language": "en",
          "string": "Count the different alma maters of people employed by the CNN"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/employer",
        "http://dbpedia.org/ontology/almaMater",
        "count"
      ]
    },
    {
      "id": "lcquad_train_2902",
      "question": [
        {
          "language": "en",
          "string": "Name a famous relative of barry voight"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Barry_Voight>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/relative",
        "none"
      ]
    },
    {
      "id": "lcquad_train_237",
      "question": [
        {
          "language": "en",
          "string": "List places that are associated to cities in the state of Mecklenburg-Vorpommern."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/federalState> <http://dbpedia.org/resource/Mecklenburg-Vorpommern> . ?uri <http://dbpedia.org/property/cities> ?x  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/federalState",
        "http://dbpedia.org/property/cities",
        "none"
      ]
    },
    {
      "id": "lcquad_train_1496",
      "question": [
        {
          "language": "en",
          "string": "Give me the characters who last appeared in Star Wars Episode 3"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/last> <http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith> } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/last",
        "none"
      ]
    },
    {
      "id": "lcquad_train_4825",
      "question": [
        {
          "language": "en",
          "string": "Which river goes through cohoes, NY"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cohoes,_New_York> <http://dbpedia.org/ontology/river> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/river",
        "none"
      ]
    }
  ]
}