{
  "dataset": {
    "id": "dataset-lcquad-train"
  },
  "questions": [
    {
      "id": "lcquad_test_3748",
      "question": [
        {
          "language": "en",
          "string": "Where is the headquarters of Sigma TV"
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sigma_TV> <http://dbpedia.org/property/headquarters> ?uri } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/headquarters",
        "none"
      ]
    },
    {
      "id": "lcquad_test_2427",
      "question": [
        {
          "language": "en",
          "string": "Count all the stateless people"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Statelessness>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/citizenship",
        "count"
      ]
    },
    {
      "id": "lcquad_test_991",
      "question": [
        {
          "language": "en",
          "string": "What are some apes?"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Ape>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/family",
        "none"
      ]
    },
    {
      "id": "lcquad_test_3577",
      "question": [
        {
          "language": "en",
          "string": "What is the successor of PlayStation 4"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/PlayStation_4>  . }"
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/property/successor",
        "none"
      ]
    },
    {
      "id": "lcquad_test_616",
      "question": [
        {
          "language": "en",
          "string": "list some companies founded by Jim Harris."
        }
      ],
      "query": {
        "sparql": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Jim_Harris_(entrepreneur)> } "
      },
      "answers": [],
      "schema_terms": [
        "http://dbpedia.org/ontology/foundedBy",
        "none"
      ]
    }
  ]
}