{
  "dataset": {
    "id": "dataset-qald-train"
  },
  "questions": [
    {
      "id": "qald_train_290",
      "question": [
        {
          "language": "en",
          "string": "List all games by GMT.",
          "keywords": "game, GMT"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Washington's_War"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Fields_of_Fire_(game)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Commands_&_Colors:_Ancients"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/A_World_At_War"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Sword_of_Rome"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Twilight_Struggle"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Chandragupta_(board_game)"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/publisher",
        "none"
      ]
    },
    {
      "id": "qald_train_1",
      "question": [
        {
          "language": "en",
          "string": "List all boardgames by GMT.",
          "keywords": "boardgame, GMT"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Washington's_War"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Fields_of_Fire_(game)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Commands_&_Colors:_Ancients"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/A_World_At_War"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Sword_of_Rome"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Twilight_Struggle"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Chandragupta_(board_game)"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/publisher",
        "none"
      ]
    },
    {
      "id": "qald_train_402",
      "question": [
        {
          "language": "en",
          "string": "Give me the currency of China.",
          "keywords": "currency, China"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Renminbi"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/currency",
        "none"
      ]
    },
    {
      "id": "qald_train_249",
      "question": [
        {
          "language": "en",
          "string": "List all the musicals with music by Elton John.",
          "keywords": "musicals, music by, Elton John"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Lion_King_(musical)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Lion_King_Jr_(musical)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Lestat_(musical)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Aida_(musical)"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/musicBy",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "none"
      ]
    },
    {
      "id": "qald_train_383",
      "question": [
        {
          "language": "en",
          "string": "Show me the book that Muhammad Ali wrote.",
          "keywords": "book, wrote, Muhammad Ali"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Greatest:_My_Own_Story"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/author",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "none"
      ]
    },
    {
      "id": "qald_train_86",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors who were born in Berlin.",
          "keywords": "actors, born, Berlin"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dru_Berrymore"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tyra_Misoux"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/birthPlace",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "none"
      ]
    },
    {
      "id": "qald_train_96",
      "question": [
        {
          "language": "en",
          "string": "List all the musicals with music by Leonard Bernstein.",
          "keywords": "musicals, music by, Leonard Bernstein"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Wonderful_Town"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Candide_(operetta)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Race_to_Urga"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/1600_Pennsylvania_Avenue_(musical)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/On_the_Town_(musical)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/West_Side_Story"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/A_Party_with_Betty_Comden_and_Adolph_Green"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Side_by_Side_by_Sondheim"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/musicBy",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "none"
      ]
    },
    {
      "id": "qald_train_94",
      "question": [
        {
          "language": "en",
          "string": "Give me all Swedish holidays.",
          "keywords": "Swedish holidays"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Gustavus_Adolphus_Day"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Veterans_Day_(Sweden)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/St._Knut's_Day"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Christmas_tree_plundering"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/country",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "count"
      ]
    },
    {
      "id": "qald_train_46",
      "question": [
        {
          "language": "en",
          "string": "Show a list of soccer clubs that play in the Bundesliga.",
          "keywords": "soccer clubs, play, Bundesliga"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Borussia_M\u00f6nchengladbach"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/SV_Darmstadt_98"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/FC_Augsburg"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Bayer_04_Leverkusen"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/VfL_Wolfsburg"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/FC_Ingolstadt_04"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Eintracht_Frankfurt"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/SC_Freiburg"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hertha_BSC"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/1._FC_K\u00f6ln"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/SV_Werder_Bremen"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/1._FSV_Mainz_05"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/FC_Schalke_04"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/RB_Leipzig"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/TSG_1899_Hoffenheim"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/FC_Bayern_Munich"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Borussia_Dortmund"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hamburger_SV"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/league",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "none"
      ]
    },
    {
      "id": "qald_train_331",
      "question": [
        {
          "language": "en",
          "string": "List all episodes of the first season of the HBO television series The Sopranos.",
          "keywords": "HBO, television series, Sopranos, first season, episodes"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Isabella_(The_Sopranos)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Meadowlands_(The_Sopranos)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Boca_(The_Sopranos)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Nobody_Knows_Anything"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Pax_Soprana"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/A_Hit_Is_a_Hit"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Denial,_Anger,_Acceptance"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/College_(The_Sopranos)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/46_Long"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Sopranos_(episode)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Down_Neck"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/seasonNumber",
        "http://dbpedia.org/ontology/series",
        "none"
      ]
    },
    {
      "id": "qald_train_347",
      "question": [
        {
          "language": "en",
          "string": "Show me all books in Asimov's Foundation series.",
          "keywords": "books, Asimov, Foundation series"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Originist"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Foundation_and_Earth"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Forward_the_Foundation"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/series",
        "none"
      ]
    },
    {
      "id": "qald_train_286",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors starring in movies directed by William Shatner.",
          "keywords": "actor, starring, movie, direct, William Shatner"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tom_Towles"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Brenda_Bakke"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/William_Shatner"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/George_Takei"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/John_Prosky"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Duane_Whitaker"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dick_Van_Patten"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Amy_Acker"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Leonard_Nimoy"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Rickey_Medlocke"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Walter_Koenig"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/DeForest_Kelley"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dan_Martin_(actor)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Chuck_Williams_(actor)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/J.T._Colosa"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/James_Doohan"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dan_Gauthier"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Nichelle_Nichols"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/director",
        "http://dbpedia.org/ontology/starring",
        "none"
      ]
    },
    {
      "id": "qald_train_371",
      "question": [
        {
          "language": "en",
          "string": "Give me all books by William Goldman with more than 300 pages.",
          "keywords": "book, William Goldman, pages, more than 300"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Marathon_Man_(novel)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hype_and_Glory"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Boys_and_Girls_Together"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tinsel_(novel)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Control_(novel)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Color_of_Light"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Princess_Bride"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Wait_Till_Next_Year"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Brothers_(Goldman_novel)"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/author",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "http://dbpedia.org/ontology/numberOfPages",
        ">"
      ]
    },
    {
      "id": "qald_train_403",
      "question": [
        {
          "language": "en",
          "string": "Give me all Swedish oceanographers.",
          "keywords": "Swedish, oceanographer"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Vagn_Walfrid_Ekman"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/birthPlace",
        "http://dbpedia.org/ontology/field",
        "none"
      ]
    },
    {
      "id": "qald_train_87",
      "question": [
        {
          "language": "en",
          "string": "Who created Goofy?",
          "keywords": "created, Goofy"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Frank_Webb_(cartoonist)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Walt_Disney"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Paul_Murry"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/creator",
        "none"
      ]
    }
  ]
}