{
  "dataset": {
    "id": "dataset-qald-train"
  },
  "questions": [
    {
      "id": "qald_train_394",
      "question": [
        {
          "language": "en",
          "string": "Give me all Canadian Grunge record labels.",
          "keywords": "record label, Canadian, Grunge"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Murderecords"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/country",
        "http://dbpedia.org/ontology/genre",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "count"
      ]
    },
    {
      "id": "qald_train_173",
      "question": [
        {
          "language": "en",
          "string": "Give me all cities in New Jersey with more than 100000 inhabitants.",
          "keywords": "New Jersey, city, inhabitants, more than 100000"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Newark,_New_Jersey"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Jersey_City,_New_Jersey"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Elizabeth,_New_Jersey"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Paterson,_New_Jersey"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/isPartOf",
        "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
        "http://dbpedia.org/ontology/populationTotal",
        ">"
      ]
    },
    {
      "id": "qald_train_9",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors starring in movies directed by and starring William Shatner.",
          "keywords": "actor, starring, movie, direct, starring, William Shatner"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tom_Towles"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Brenda_Bakke"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/William_Shatner"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/John_Prosky"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dan_Martin_(actor)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Duane_Whitaker"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Chuck_Williams_(actor)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dick_Van_Patten"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/J.T._Colosa"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dan_Gauthier"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Amy_Acker"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Rickey_Medlocke"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/director",
        "http://dbpedia.org/ontology/starring",
        "http://dbpedia.org/ontology/starring",
        "http://dbpedia.org/property/starring",
        "none"
      ]
    },
    {
      "id": "qald_train_180",
      "question": [
        {
          "language": "en",
          "string": "Is Darth Vader Luke\u2019s father?",
          "keywords": "Darth Vader, father, Luke"
        }
      ],
      "query": {
        "sparql": "ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker> }"
      },
      "answers": [
        {
          "head": {},
          "results": {},
          "boolean": true
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/child",
        "none"
      ]
    },
    {
      "id": "qald_train_178",
      "question": [
        {
          "language": "en",
          "string": "List the seven kings of Rome.",
          "keywords": "kings, Rome"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tullus_Hostilius"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Lucius_Tarquinius_Superbus"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Servius_Tullius"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Ancus_Marcius"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Romulus_and_Remus"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Numa_Pompilius"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Lucius_Tarquinius_Priscus"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/property/title",
        "none"
      ]
    },
    {
      "id": "qald_train_210",
      "question": [
        {
          "language": "en",
          "string": "Who created Batman?",
          "keywords": "Batman, creator"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Bob_Kane"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Bill_Finger"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/creator",
        "none"
      ]
    },
    {
      "id": "qald_train_275",
      "question": [
        {
          "language": "en",
          "string": "List the children of Margaret Thatcher.",
          "keywords": "Margaret Thatcher, child"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Carol_Thatcher"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Mark_Thatcher"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/child",
        "none"
      ]
    },
    {
      "id": "qald_train_367",
      "question": [
        {
          "language": "en",
          "string": "Give me the grandchildren of Elvis Presley.",
          "keywords": "Elvis Presley, grandchildren"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Riley_Keough"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/child",
        "http://dbpedia.org/ontology/child",
        "none"
      ]
    },
    {
      "id": "qald_train_412",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors starring in Last Action Hero.",
          "keywords": "actor, starring, Last Action Hero"
        }
      ],
      "query": {
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tom_Noonan"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/F._Murray_Abraham"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Arnold_Schwarzenegger"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Mercedes_Ruehl"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Charles_Dance"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Art_Carney"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Frank_McRae"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Austin_O'Brien"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Robert_Prosky"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Anthony_Quinn"
                }
              }
            ]
          }
        }
      ],
      "schema_terms": [
        "http://dbpedia.org/ontology/starring",
        "none"
      ]
    }
  ]
}